package Task02;

/*Написать программу – телефонная книга.
Программа должна иметь возможность создавать и сохранять новые контакты. Просматривать ранее сохраненные имена.
Искать контакт по номеру телефона или по имени. Контакт может включать в себя:
■ имя;
 ■ фамилия;
■ прозвище;
■ номера телефонов (неограниченное количество, может быть несколько с одинаковым типом).
 Номера телефонов не должны повторяться для разных контактов (домашний, рабочий, мобильный, факс)
 ■ электронные адреса (проверка на корректность);
■ год рождения.
*/

public class Task02 {
    public static void main(String[] args) {
        PhoneBookApp app = new PhoneBookApp();
        app.run();
    }
}